{
  "id": "懸",
  "kanjialiveData": null,
  "jishoData": {
    "query": "懸",
    "found": true,
    "taughtIn": "junior high",
    "jlptLevel": "N1",
    "newspaperFrequencyRank": "889",
    "strokeCount": 20,
    "meaning": "state of suspension, hang, depend, consult, distant, far apart",
    "kunyomi": [
      "か.ける",
      "か.かる"
    ],
    "onyomi": [
      "ケン",
      "ケ"
    ],
    "onyomiExamples": [
      {
        "example": "懸賞",
        "reading": "ケンショウ",
        "meaning": "offering a prize, prize competition, prize, reward"
      },
      {
        "example": "懸案",
        "reading": "ケンアン",
        "meaning": "pending question, unresolved problem"
      },
      {
        "example": "倒懸",
        "reading": "トウケン",
        "meaning": "hanging (someone) upside down"
      },
      {
        "example": "懸案",
        "reading": "ケンアン",
        "meaning": "pending question, unresolved problem"
      },
      {
        "example": "懸念",
        "reading": "ケネン",
        "meaning": "worry, fear, anxiety, concern"
      },
      {
        "example": "鈴懸",
        "reading": "スズカケ",
        "meaning": "plane tree (esp. the Oriental plane, Platanus orientalis), hemp overgarment worn by Shugendō practitioners"
      },
      {
        "example": "手掛け",
        "reading": "テカケ",
        "meaning": "handle, mistress, kept woman, concubine"
      }
    ],
    "kunyomiExamples": [
      {
        "example": "掛ける",
        "reading": "かける",
        "meaning": "to hang up (e.g. a coat, a picture on the wall), to let hang, to suspend (from), to hoist (e.g. sail), to raise (e.g. flag), to put on (e.g. a blanket), to put on top of, to cover, to lay, to spread, to put on (glasses, etc.), to wear (a necklace, etc.), to make (a call), to spend (time, money), to expend, to use, to pour (liquid) onto, to sprinkle (powder or spices) onto, to splash, to throw (e.g. water) onto, to turn on (an engine, radio, etc.), to set (a dial, alarm clock, etc.), to put on (a DVD, song, etc.), to use (a device, implement, etc.), to cause (someone inconvenience, trouble, etc.), to burden (someone), to impose, to multiply (arithmetic operation), to secure (e.g. lock), to take a seat, to sit, to rest (something on something else), to support (something on something else), to bind, to wager, to bet, to risk, to stake, to gamble, to put an effect (spell, anaesthetic, etc.) on, to hold (a play, festival, etc.), to hold an emotion for (pity, hope, etc.), to argue (in court), to deliberate (in a meeting), to present (e.g. idea to a conference, etc.), to increase further, to catch (in a trap, etc.), to set atop, to erect (a makeshift building), to apply (insurance), to pun (on a word), to use (a word) as a pivot word, to play on words, to be partway doing ..., to begin (but not complete) ..., to be about to ..., to address (someone), to direct (something, to someone), to do (something, to someone)"
      },
      {
        "example": "掛かる",
        "reading": "かかる",
        "meaning": "to take (a resource, e.g. time or money), to hang, to come into view, to arrive, to come under (a contract, a tax), to start (engines, motors), to attend, to deal with, to handle, to have started to, to be on the verge of, to overlap (e.g. information in a manual), to cover, to (come) at, to be fastened, to be covered (e.g. with dust, a table-cloth, etc.), to be caught in, to get a call, to depend on, to begin (a task), to set about (doing), to get down to"
      }
    ],
    "radical": {
      "symbol": "心",
      "forms": [
        "忄",
        "⺗"
      ],
      "meaning": "heart"
    },
    "parts": [
      "ノ",
      "小",
      "幺",
      "心",
      "目",
      "糸"
    ],
    "strokeOrderDiagramUri": "http://classic.jisho.org/static/images/stroke_diagrams/25080_frames.png",
    "strokeOrderSvgUri": "https://d1w6u4xc3l95km.cloudfront.net/kanji-2015-03/061f8.svg",
    "strokeOrderGifUri": "https://raw.githubusercontent.com/mistval/kanji_images/master/gifs/61f8.gif",
    "uri": "https://jisho.org/search/%E6%87%B8%23kanji"
  }
}